{"quotes":["Aikido is not merely about fighting and the development of the physical self but the perfection of the spiritual man at the same time. It has very harmonious movements, very beautiful to watch and beautiful for your body to feel.\n","Most of the kids that I meet in the street are serious hardened criminals that I meet in the street, never had a mother and a father to love them, to protect them, to teach them right from wrong and lead them out of crime and gangs and stuff like that.","Any great warrior is also a scholar, and a poet, and an artist.","My philosophy is that the most important aspect of any religion should be human kindness. And to try to ease the suffering of others. To try to bring light and love into the lives of mankind.","Try to find the path of least resistance and use it without harming others. Live with integrity and morality, not only with people but with all beings.","You can say that I lived in Asia for a long time and in Japan I became close to several CIA agents. And you could say that I became an adviser to several CIA agents in the field and, through my friends in the CIA, met many powerful people and did special works and special favors.","It is a lot harder now to be a police officer than what it used to be.","I love getting out on the streets and helping people.","The most important seed I can sow in this life is my children, and the love and knowledge that I can bestow upon them and the help I can give them.","Believe it or not, there are some things that I have written that would be kind of a dream to make. Hopefully, I will get to finance them... There is something that I wrote called 'Demon's Flare' which would kind of be a dream come true."],"biography":[{"title":"Early life","blocks":[{"text":"Seagal was born in Lansing, Michigan, where he lived until he was five years old, when his family moved to California. His mother, Patricia (1930–2003), was a medical technician, and his father, Samuel Seagal (1928–1991), was a high school math teacher. His mother was of English, German, and Dutch ancestry and his father was Jewish (the son of emigrants from Russia). In a Russian interview, Seagal stated that he had a Mongolian grandfather (either Buryat or Kalmyk). His parents relocated to Fullerton, California, where Seagal attended Buena Park High School in Buena Park.","images":[]}]},{"title":"Biography","blocks":[{"text":"Steven was Born in Lansing, Michigan on April 10, 1952","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-young.jpg","url":""}]},{"text":"A son of a Math teacher and a Medical Technician, Steven’s humble childhood was underscored by a fascination with the Martial Arts and the blues.","images":[]},{"text":"Steven Seagal is a man of diverse character whose spiritual beliefs and humanity are woven into every aspect of his life.","images":[]},{"text":"Some would say that this is a strange combination, but ask any Martial Arts expert or blues legend and they will both tell you that it is the spirit that reaches deep within your soul that drives the artistry.","images":[]},{"text":"Call it an obsession or a calling but Steven mastered Martial Arts at an early age, becoming a 7th degree black belt and Aikido master.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Martial-Arts-richard.jpg","url":""}]},{"text":"ost of us know Steven for his roles as an action hero with an acting career that was launched from his Los Angeles Dojo in the late 80′s where he taught Martial Arts to the likes of Sean Connery, James Coburn and the famed talent agent, Michael Ovitz.","images":[]},{"text":"It was Mr. Ovitz who paved the way for Steven to co-write and star in his first and hugely successful action film “Above the Law” in 1988.From this initial success it launched a career that now spans over 22 years and nearly 40 x movies, plus 2 x major Television series and $2 billion in box office revenues.","images":[]},{"text":"Steven immerses himself in his work on the screen, writing, producing, directing and acting.","images":[]},{"text":"His films include box office successes such as Hard to Kill, Marked for Death, Out for Justice, Above the Law, Under Siege, Executive Decision, The Glimmer Man, and Exit Wounds to name a few, are all loved for their storylines and fast paced Hollywood action.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-121-300x204.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-131.jpg","url":""}]},{"text":"At the core of what drives Steven Seagal with all he does – his music, his Martial Arts and his acting – is his commitment to Asian philosophies and religion.","images":[]},{"text":"As a Buddhist, Zen teacher, and healer, Steven lives by the principles that the development of the physical self is essential to protect the spiritual man.","images":[]},{"text":"He believes that what he does in his life is about leading people into contemplation to wake them up and enlighten them in some manner.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Spiritual-236x300.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Spiritual-31-300x265.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Spiritual-4.jpg","url":""}]},{"text":"Steven lived and learned Japanese culture for over 15 years and his spiritual beliefs play a big role in his life.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-with-guitar-1.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-with-guitar-4.jpg","url":""}]},{"text":"It is what has guided him to not only become a Martial Arts expert but, also a beloved actor, and distinguished Blues musician.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-with-guitar.jpg","url":""}]},{"text":"Most importantly, it is his genuine care for others that drives him to unselfishly give his time and financial support to many charities across the world.His support of environmental causes, animal rights, children in need and HIV/AIDS efforts is undeniable and an important part of his daily schedule.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-with-Children-300x200.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-with-Animals-300x189.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-in-Africa-300x207.jpg","url":""}]},{"text":"Steven Seagal is a versatile talent and an intricate human being, whose passion, selflessness, integrity and character are embodied in his work.To those that know Steven, they will tell you he is a deeply caring, giving and humble individual.","images":[]},{"text":"To all of us who have enjoyed his movies, listened to his music, seen his Martial Arts expertise and learned about him as a person, we consider ourselves fortunate and are excited about what the future holds.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-221.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-111.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-51.jpg","url":""}]}]},{"title":"1980s – 1990s","blocks":[{"text":"In 1987, Seagal began work on his first film, Above the Law (titled Nico in Europe), with director Andrew Davis and reportedly as a favor to a former aikido student, the agent Michael Ovitz. Ovitz took Seagal to Warner Brothers to put on an aikido demonstration and the executives were impressed by him and offered him several scripts; Seagal turned them down but agreed to write what would become Above the Law. Following its success, Seagal made three more movies – Hard to Kill, Marked for Death, and Out for Justice – that were box office hits, making him an action hero. Later, he achieved wider, mainstream success in 1992 with the release of Under Siege (1992). That film reunited Seagal with director Andrew Davis, and was a blockbuster in the U.S. and abroad, grossing $156.4 million worldwide.","images":[]},{"text":"Seagal hosted the April 20, 1991 episode of the late night variety show Saturday Night Live, which aired as the 18th episode of the 16th season. Cast member David Spade regarded Seagal as the show's worst host during Spade's time there. Spade and co-star Tim Meadows cite Seagal's humorlessness, his ill treatment of the show's cast and writers, and his refusal to do a \"Hans and Franz\" sketch because that skit's titular characters stated that they could beat up Seagal. Seagal was never invited back to the show following that episode. Meadows commented, \"He's didn't realize that you can't tell somebody they're stupid on Wednesday and expect them to continue writing for you on Saturday.\" The cast and crew's difficulties with Seagal were later echoed on-air by producer Lorne Michaels during guest host Nicholas Cage's monologue in the September 28, 1992 Season 18 premiere. When Cage worried that he would do so poorly that the audience would regard him as \"the biggest jerk who's ever been on the show\", Michaels replied, \"No, no. That would be Steven Seagal.\"","images":[]},{"text":"Seagal directed On Deadly Ground (1994). This film, in which he also starred, emphasized environmental and spiritual themes, signaling a break with his previous persona as a genre-ready inner-city cop. The film featured Michael Caine as well as R. Lee Ermey and Billy Bob Thornton in minor supporting roles. On Deadly Ground was poorly received by film critics, but despite many critics denouncing Seagal's long environmental speech in the film, Seagal considers it to have been one of the most important and relevant moments in his career. Seagal filmed a sequel to one of his most successful films, Under Siege, titled Under Siege 2: Dark Territory (1995), and cop drama The Glimmer Man (1996). In 1996, he had a role in the Kurt Russell film Executive Decision, in which he played a special ops soldier who only appears in the film's first 45 minutes. He subsequently made another environmentally conscious film, Fire Down Below (1997), wherein he was an EPA agent fighting industrialists dumping toxic waste in the Kentucky hills, but the movie was commercially unsuccessful. This film ended his original multi-picture contract with Warner Bros.","images":[]}]},{"title":"Aikido","blocks":[{"text":"At the age of 13, Seagal lied about his age and got a job as a dishwasher at a restaurant named The Wagon Wheel. One of the cooks at the restaurant was a Japanese shotokan karate expert and noticed Seagal moved very quickly around the kitchen. He taught Seagal the basics of karate. Seagal began training in aikido under master Harry Kiyoshi Ishisaka, founder of the Orange County Aikido School (Orange County Aiki Kai) (OCAK) in 1964. Seagal considers him to have been the most important martial arts teacher in his life. Seagal moved to Japan at some point between the ages of 19 and 21 with his father who was visiting for military purposes, and met karate masters and decided to remain in Japan. He received his 1st dan degree (Shodan) under the direction of Koichi Tohei. He continued to train in aikido as a student of Seiseki Abe, Tohei (whose aikido organization, Ki Society, Seagal refused to join in favor of staying with the Aikikai), Kisaburo Osawa, Hiroshi Isoyama and the second doshu Kisshomaru Ueshiba. He attained a 7th dan degree and Shihan in aikido, he also holds black belts in karate, judo and kendo and became the first foreigner to operate an aikido dojo in Japan.","images":[]},{"text":"After returning to California in 1974, Seagal met Miyako Fujitani, an aikido instructor teaching in Los Angeles. He returned with her to her native Japan in 1975 where they married. When Seagal's father-in-law, also an aikido instructor, retired, Seagal became the new head of the organization known as Tenshin Aikido in Jūsō, Osaka City (affiliated with the Aikikai). Seagal is known by his students as Take Sensei. When Seagal left his dojo in Osaka, his then-wife Miyako became the caretaker of the dojo which has continued to the present day. Seagal initially returned to Taos, New Mexico, with his student (and later film stuntman) Craig Dunn, where they opened a dojo, although Seagal spent much of his time pursuing other ventures. After another period in Japan, Seagal returned to the U.S. in 1983 with senior student Haruo Matsuoka. They opened an aikido dojo, initially in North Hollywood, California, but later moved it to the city of West Hollywood. Seagal left Matsuoka in charge of the dojo, which he ran until the two parted ways in 1997.","images":[]},{"text":"He has helped train Brazilian mixed martial artists Anderson Silva and Lyoto Machida. Silva, who is the former UFC Middleweight Champion, went on to knock out Vitor Belfort with a kick, in their fight at UFC 126 in February 2011, and Machida also credited him for helping him perfect the front kick that he used to knock out Randy Couture at UFC 129 in May 2011","images":[]}]},{"title":"Video work","blocks":[{"text":"The next year, Seagal made The Patriot, another environmental thriller which was his first direct-to-video release in the United States (though it was released theatrically in most of the world). Seagal produced this film with his own money, and the film was shot on-location on and near his farm in Montana.","images":[]},{"text":"After producing Prince of Central Park, Seagal returned to cinema screens with the release of Exit Wounds in March 2001. The film had fewer martial arts scenes than Seagal's previous films, but it was a commercial success, taking almost $80 million worldwide. However, he was unable to capitalize on this success and his next two projects were both critical and commercial failures. The movie Ticker, co-starring Tom Sizemore and Dennis Hopper, was filmed in San Francisco before Exit Wounds, and went straight to DVD. Half Past Dead, starring rap star Ja Rule, made less than $20 million worldwide.","images":[]},{"text":"All of the films Seagal has made since the latter half of 2001 have been released direct-to-video (DTV) in North America, with some theatrical releases to other countries around the world. Seagal is credited as a producer and sometimes a writer on many of these DTV movies, which include Black Dawn, Belly of the Beast, Out of Reach, Submerged, Kill Switch, Urban Justice, Pistol Whipped, Against the Dark, Driven to Kill, A Dangerous Man, Born to Raise Hell and The Keeper, a movie released in Japan fifteen weeks earlier than the United States.","images":[]}]},{"title":"Big screen","blocks":[{"text":"In 2009, A&E Network premiered the reality television series; Steven Seagal: Lawman, focusing on Seagal as a deputy in Louisiana. In 2010, Seagal appeared in his first theatrically released film in nearly a decade, as the main villain in Robert Rodriguez' Machete. In 2011, he produced and starred in a 13-episode television series entitled True Justice. It was renewed for a second season on ReelzChannel in 2012. In the UK, True Justice has been repackaged as a series of DVD \"movies,\" with each disc editing together two episodes.","images":[]}]},{"title":"Other - Music Music Music... Other - Music Music Music...","blocks":[{"text":"In addition to acting and aikido, Seagal also plays the guitar, and his songs have been featured in several of his movies (such as Fire Down Below and Ticker).","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/music1.jpg","url":"https://youtu.be/1rMH7Y-2Bio"}]},{"text":" In 2005, he released his first album, Songs from the Crystal Cave, which has a mix of pop, world, country and blues music. It features duets with Tony Rebel, Lt. Stichie, Lady Saw, and Stevie Wonder.","images":[{"image":"http://www.virginmedia.com/images/actors-steven-seagal-590x35.jpg","url":""},{"image":"http://www.goturkey.com/uploads/93b8460a3b72a7034b472fadc938bd36.jpg","url":""}]},{"text":"The soundtrack to Seagal's 2005 film Into the Sun features several songs from the album. One of his album tracks, \"Girl It's Alright\", was also released as a single in parts of the world alongside an accompanying music video created for it.\n\nSeagal's second album, titled Mojo Priest, was released in April 2006. Subsequently, he spent summer 2006 touring the United States and Europe with his band, Thunderbox, in support of the album.","images":[{"image":"http://www.covershut.com/cd_covers/Steven-Seagal-Songs-From-The-Crystal-Cave-Cd-Cover-30533.jpg","url":""},{"image":"http://www.covershut.com/cd_covers/Steven-Seagal-Mojo-Priest-Cd-Cover-51973.jpg","url":""}]}]},{"title":"Martial Arts","blocks":[{"text":"Steven Seagal is known worldwide for his Martial Arts abilities and deep knowledge of Aikido and Spiritually, due to the sheer size of information on Stevens martial arts career, we plan to slowly expand this “Martial Arts” section throughout 2012 to offer a more detailed history, please find below a basic introduction.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-41.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-101.jpg","url":""}]},{"text":"Steven Seagal, is a 7th dan degree and Shihan in Aikido.","images":[]},{"text":"Steven moved to Japan in his late teens and became the first foreigner to operate an Aikido dojo in Japan.","images":[]},{"text":"Steven was trained by Harry Ishisaka and received 1st dan degree or Shodan under the direction of Koichi Tohei.","images":[]},{"text":"He continued to train in Aikido as a student of Seiseki Abe, Koichi Tohei (to whose Aikido organization, Ki Society, Seagal refused to join in favor of staying with the Aikikai), Kisaburo Osawa, Hiroshi Isoyama and the second doshu Kisshomaru Ueshiba.","images":[]},{"text":"When Stevens then wife, Miyako’s father retired from his job as an instructor, Seagal became the new head of the organization known as Tenshin Aikido in Osaka (affiliated with the Aikikai).","images":[]},{"text":"Seagal is known by his students as “Take Sensei”","images":[]},{"text":"When Steven left his dojo in Osaka his ex wife, Miyako continued as the care-taker of the dojo up to the present day.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-151.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-91.jpg","url":""}]},{"text":"Steven initially returned to Taos, New Mexico, with his student (and later film stuntman) Craig Dunn. Where, they opened a dojo.","images":[]},{"text":"After another period in Japan, Steven finally returned to the U.S. in 1983 with senior student Haruo Matsuoka. They opened an aikido dojo, initially in Burbank, California, but later moved it to the city of West Hollywood.","images":[]},{"text":"Steven left Matsuoka in charge of the dojo, which he ran until the two parted ways in 1997.","images":[]},{"text":"Meanwhile word of Stevens martial arts skills and teachings were spreading in Hollywood and he had a number of high profile and influential students, including famed talent agent, Michael Ovitz.","images":[]},{"text":"It was Mr. Ovitz who paved the way for Steven to co-write and star in his first and hugely successful action film in 1988 entitled “Above the Law” (titled “Nico” in Europe), which was directed by Andrew Davis and since that point Sensei Steven Seagal “Action Hero” was launched to the world.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/steven-seagal1.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/steven-seagal-teaching.jpg","url":""}]},{"text":"Since beginning his Hollywood career Steven continued his spiritual path and growth as a martial artist, making many trips to work with dojos and giving countless advice to many students a his duty as “Take Sensei”.","images":[]},{"text":"Steven has always respected fighting sports such as Boxing and the ever growing Mixed Martial Arts & UFC Championship.","images":[]},{"text":"However, Stevens’s skill as “Teacher” and a “Sensei” came to be world news in 2011 when two amazing story’s broke.","images":[]},{"text":"The story’s unfolded when it was discovered that Steven had separately helped train Brazilian mixed martial artists Anderson Silva and Lyoto Machida.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/steven-seagal-and-lyoto-training.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/steven-seagal-and-lyoto1.jpg","url":""}]},{"text":"Silva, who is the reigning UFC Middleweight Champion, credited Seagal with teaching him “the kick” that knocked out Vitor Belfort in their fight at UFC 126 in February 2011 and then if that was not enough Lyoto Machida also credited Steven for helping him perfect the “crane kick” that he used to devastating effect to knock out Randy Couture at UFC 129 in May 2011.","images":[]},{"text":"Up until that point this “type of kick” had never been seen in the UFC.","images":[]},{"text":"On May 5, 2011, Steven appeared on the Sherdog Radio Network’s “It’s Time” show with Bruce Buffer and spoke about his relationship with Silva and Machida as well his training methods.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Anderson-and-Steven-Seagal.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/anderson-silva-training-with-steven-seagal.jpg","url":""}]},{"text":"Steven explained: “Anderson had originally sent me a little postcard saying, ‘Please teach me your lethal stuff’. Because a lot of my students know that a lot of the stuff I have is punishing or effective, shall we say.","images":[]},{"text":"They left a number, and the number was Jorge Guimaraes, the manager of those guys in Black House. He said, ‘Yeah, man, the guys all want to learn from you.’ I went over there and began”.","images":[]},{"text":"In regards to his teaching of the kicks he said: “With Lyoto, I came in probably five days before the (Couture) fight, something like that, started working on different kinds of elbows, different kinds of punching, different kinds of footwork… but particularly “the kick”.","images":[]},{"text":"Footage of Steven’s training sessions with both Anderson Silva and Lyoto Machida have since surfaced on You Tube to add even further validation.","images":[]},{"text":"Whether it be helping world champion UFC fighters with devastating moves or inspiring thousands to take up the martial arts with his films and teachings, Steven Seagal continues to spread both his skills and Spiritually into the future.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/master.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/steven-seagal-teaching-2.jpg","url":""}]}]},{"title":"Other - Music..","blocks":[{"text":"","images":[]}]},{"title":"Other - Music..","blocks":[]},{"title":"Other - Music..","blocks":[{"text":"","images":[{"image":"https://static-secure.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/2/13/1392313040984/Terrorists--mess-with-thi-010.jpg","url":""}]}]}],"philantropy":[{"title":"Philantropy","blocks":[{"text":"Some of Steven Seagal’s greatest accomplishments in life are with the charities he supports and has started.\nSteven is a man who extends his success to various philanthropic causes, including needy children around the world, the environment, animal rights and AIDS projects.\nHis deep love and care for his family and the human race is exemplified in his commitment to do his part to make this a better world.\nSteven has supported many charities including several environmental causes to protect what he feels is “the world that has been bestowed upon us – natural beauty and gifts from our land”.\nSteven always makes time for charitable causes, first and foremost, he is a human being with a deep devotion for his fellow man and the environment around us.\nPlease find below in more detail just “some” of Steven’s Humanitarian achievements of which he is deeply proud.","images":[]}]},{"title":"Awards","blocks":[{"text":"Here are just a few awards that Steven has been honoured with over the years;\n\n- First Annual Environmental Media Awards September 30,\n1991\n- PETA Humanitarian Award in 1999\n- Sashi 2001 Humanitarian Award\n- Honoured as the first private citizen to destroy a\nNuclear Device","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Awards-11.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Awards-3.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Awards-2.jpg","url":""}]}]},{"title":"Activity","blocks":[{"text":"Steven contributed to the Campaign For Burma in the “Burma It Can’t Wait” – Day 18 Video Message.","images":[{"image":"http://img.youtube.com/vi/dh-kiYwF8pk/0.jpg","url":"http://www.youtube.com/watch?feature=player_embedded&v=dh-kiYwF8pk"}]},{"text":"Steven is also a frequent visitor to many Children’s Homes, Orphanages and Hospitals the world over where he brings gifts and his love to the sick and disadvantaged Children.“My devotion to the children stems directly from my devotion to the Divine,” “The Buddhist philosophy is to put others before ourselves.” STEVEN SEAGAL","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-handing-out-gifts-1.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-Visited-Orphanage-by-Kiev-September-17-2007-3-300x199.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-Seagal-visited-Finkelela-Childrens-Hospital-South-Africa-May-1.jpg","url":""}]},{"text":"Steven helps and supports The ‘Save A Millions Lives Campaign’ a project initiated by the Neko Tech Centre in the Ada region of Ghana.\nIt is primarily a health project that deals with a wide range of issues affecting the community due to the HIV & AIDS epidemic in the region.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/AIDS-Mission-Africa-2005.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/AIDS-Mission-Africa-2005-1.jpg","url":""}]},{"text":"Steven visited patients of the Bakulev Cardio-Vascular Surgery Center in Moscow, and attend The International Golden Heart Prize award ceremony for the “Service to the highest ideals of mankind”. May 21, 2006.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Bakulev-Cardio-Vascular-Center-Moscow-1.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Bakulev-Cardio-Vascular-Center-Moscow-2.jpg","url":""}]},{"text":"Steven paid his respects and visited old and sick people in Republic of South Africa whilst filming in 2005.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/old-1.jpg","url":""}]},{"text":"Steven also put his name to a the campaign “Be Intelligent, Not Violent” initiated by the Bucharest police in Romania.The launch took place at an orphanage and the ten children were invited by Steven to attend the shooting of several scenes from his movie.\nSteven said his intention was to prove to children that the “fights” in the movies are not real and that violence is always defeated by intelligence.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-Seagal-meets-orphan-children-Romania-May-4-2005.jpg","url":""}]},{"text":"Steven has seen first-hand what devastation can be caused by natural disasters; he visited the flood-damaged village of Milcovul, 190 km (118 miles) northeast of Bucharest, August 6, 2005 where Steven handed over a convoy of goods from an auction to raise funds for the victims of a flood that hit Romania the previous month","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-Seagal-in-the-flood-damaged-village-of-Milcovul.jpg","url":""}]},{"text":"Closer to home Steven was deeply saddened by the after the Hurricane Katrina Disaster and attended various events to raise support and awareness, he attended the Mardi Gras Parades on February 27, 2006, he then decided to come back and make a film at New Orleans and Gulf Coast area.Steven then became a member the Rebuilding New Orleans & LA Community , also getting involved with the local SWAT teams and helping donate $250.000 for a Children’s Hospital in New Orleans with Jefferson Parish Sheriff Harry Lee and Country legend Willie Nelson.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-helped-SWAT-Team-after-the-Hurricane-of-Kathrina-in-New-Orleans.jpg","url":""}]},{"text":"Steven also works for the Peace of the World and due to his love of the Japanese culture and his time spend there as a budding martial artist supported the amazing event ‘Full Circle’ to Return the ‘Atomic Flame’ from Hiroshima, wherby the “Atomic Flame” will arrive from Japan aboard the Nippon Maru.The “Flame” was kindled from the actual burning embers of Hiroshima 60 years ago, after the world’s first atomic bomb was dropped.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-Seagal-Honored-as-First-Private-Citizen-to-Destroy-a-Nuke1.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-Seagal-Honored-as-First-Private-Citizen-to-Destroy-a-Nuke2.jpg","url":""}]},{"text":"Protected by Zen Monks, the original flame still burns today and has become a symbol of hope for peace and a reminder of the horrors of nuclear weapons.AND as if that wasn’t amazing enough in November 2005 Steven led the way as the first individual to personally sponsor the disarming and disposal of a “high risk” Russian nuclear missile with a donation of $100,000.","images":[]},{"text":"The popular mayor of the city of Yokohama Hiroshi Nakada, welcomed Steven together with a delegation from the GND Fund, to the city in a formal meeting attended by members of the press.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/press-1.jpg","url":""}]},{"text":"During the meeting Mayor Nakata expressed his sincere gratitude to Seagal for championing a cause so dear to the people of Japan, and pledged “full support” from the city that was the site of the surrender treaty ending WWII, of the efforts made by Seagal and the GND Fund to destroy nuclear weapons.At the end of the official meeting Mayor Nakata presented an official proclamation commending Seagal as the first private citizen to destroy a nuclear weapon.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/press-2.jpg","url":""}]},{"text":"Steven is an anti-drug campaigner and has supported numerous campaigns including D.A.R.E Kids Drug Abuse Resistance Education and Anti-Drug Campaigns in Romania.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-Seagal-attendeed-Anti-Drug-Campaigns-in-Bucharest-and-Romania.jpg","url":""},{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-Seagal-and-D.A.R.E-Kids.jpg","url":""}]},{"text":"“For me, money and fame are not the greatest things in life. Instead it is my ability to help others that really matters.” – STEVEN SEAGALSteven is an Animal lover and Animal rights campaigner; he has always been an outspoken opponent of animal cruelty.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Seagal-1-300x202.jpg","url":""}]},{"text":"Steven has described his activism method as “shaming companies into changing.”He has worked with PETA to discourage the fur trade, and has written to the Prime Minister of India to seek increased legal protection for cows.","images":[]},{"text":"Seagal worked effectively towards saving dogs destined to drown in Taiwan; he singlehandedly pressured the Premier of Taiwan to sign legislation limiting animal cruelty.","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2011/07/Steven-Seagal-displays-an-unhappy-outlook-when-visiting-a-private-shelter-for-stray-dogs.jpg","url":""}]},{"text":"He also prevented the export of baby elephants from South Africa to Japan.For these and other efforts, Seagal was awarded a PETA Humanitarian Award in 1999.","images":[]},{"text":"“What I do in this life is only important if I can ease suffering of others, if I can somehow make the world a better place” – STEVEN SEAGAL","images":[{"image":"http://stevenseagal.com/wp-content/uploads/2012/01/Steven-Spiritual-5.jpg","url":""}]}]},{"title":"Business ventures - Business ventures","blocks":[{"text":"In 1997, a company called Young Living Essential Oils announced it was \"working closely\" with Seagal on a line of \"therapeutic oil\" products. The company claimed that Seagal had also allowed them to \"use his Montana ranch as an additional site to grow [the] plants used to distill Young Living's Essential Oils...\" As of 2015, the company does not mention Seagal or any products co-created with him on its official website.","images":[{"image":"http://cdn2.thr.com/sites/default/files/imagecache/300_portrait/2015/05/steven_seagal_p_15.jpg","url":""}]},{"text":"In 2005, Seagal Enterprises began to market an energy drink known as Steven Seagal's Lightning Bolt. In the press material, Seagal claimed, \"I have traveled the world creating this drink; there is none better that I know.\" In 2009, his official twitter profile released a tweet promising \"Lightning Bolt will be back soon,\" but as of 2015 the official website is defunct and it appears that production has been discontinued.","images":[{"image":"https://upload.wikimedia.org/wikipedia/en/thumb/a/ad/Steven-Seagal-Drink-4313.jpg/150px-Steven-Seagal-Drink-4313.jpg","url":""}]},{"text":"Seagal has also marketed an aftershave called \"Scent of Action,\" and a range of knives and weapons.\n\nIn 2013 Steven Seagal joined newly formed Russian firearms manufacturer ORSIS, representing the company in both a promotional capacity as well as lobbying for the easement of US import restrictions on Russian sporting firearms. It was also announced he would work with the company to develop a signature long range rifle known provisionally as \"ORSIS by Steven Seagal\".","images":[{"image":"http://77rus.smugmug.com/Military/Private-Companies-Def-Industry/i-kKLz53q/0/M/ORSIS30-M.jpg","url":"https://youtu.be/Pb6glBHBfgs"}]}]}],"filmography":[{"title":"Above the Law","year":1988,"duration":109,"about":"#fz15#fn{circe}#fb Director:#fb0#fn{circe light} Andrew Davis\n#fn{circe}#fb Writer:#fb0#fn{circe light} Andrew Davis, Steven Seagal\n#fn{circe}#fb Stars:#fb0#fn{circe light} Steven Seagal, Pam Grier, Henry Silva","desc":"A former Special Operations Vietnam vet works as a Chicago cop and uncovers CIA wrongdoing.","itunes_link":"https://itunes.apple.com/us/movie/above-the-law/id279598691","netflix_link":"","image":"http://st-im.kinopoisk.ru/im/poster/6/2/3/kinopoisk.ru-Above-the-Law-623343.jpg","small_image":"http://st-im.kinopoisk.ru/im/poster/6/2/3/kinopoisk.ru-Above-the-Law-623343.jpg","blocks":[{"image":"http://img.youtube.com/vi/BsbYE-Q474I/0.jpg","url":"http://www.youtube.com/watch?v=BsbYE-Q474I"},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/4/2/kinopoisk.ru-Above-the-Law-2429307.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/4/2/kinopoisk.ru-Above-the-Law-2429306.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/7/kinopoisk.ru-Above-the-Law-2277143.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/7/kinopoisk.ru-Above-the-Law-2276105.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/7/kinopoisk.ru-Above-the-Law-2276104.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/7/kinopoisk.ru-Above-the-Law-2276103.jpg","url":""}]},{"title":"Hard to Kill","year":1990,"duration":106,"about":"#fz15#fn{circe}#fb Director:#fb0#fn{circe light} Bruce Malmuth\n#fn{circe}#fb Writer:#fb0#fn{circe light} Steven McKay\n#fn{circe}#fb Stars:#fb0#fn{circe light} Steven Seagal, Kelly LeBrock, William Sadler","desc":"Mason Storm, a 'do it alone' cop, is gunned down at home. The intruders kill his wife, and think they've killed both Mason and his son too. Mason is secretly taken to a hospital where he spends several years in a coma. His son meanwhile is growing up thinking his father is dead. When Mason wakes up, everyone is in danger - himself, his son, his best friend, his nurse - but most of all those who arranged for his death","itunes_link":"https://itunes.apple.com/us/movie/hard-to-kill/id279598776","netflix_link":"","image":"http://st-im.kinopoisk.ru/im/poster/7/4/8/kinopoisk.ru-Hard-to-Kill-748919.jpg","small_image":"http://st-im.kinopoisk.ru/im/poster/7/4/8/kinopoisk.ru-Hard-to-Kill-748919.jpg","blocks":[{"image":"http://img.youtube.com/vi/V25xb9MHklo/0.jpg","url":"http://www.youtube.com/watch?v=V25xb9MHklo"},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/8/kinopoisk.ru-Hard-to-Kill-2283246.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2268115.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2268114.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2268113.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2268112.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2268111.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2264425.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2264424.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2264423.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2264422.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/2/6/kinopoisk.ru-Hard-to-Kill-2264420.jpg","url":""}]},{"title":"Under Siege","year":1992,"duration":103,"about":"#fz15#fn{circe}#fb Director:#fb0#fn{circe light} Andrew Davis\n#fn{circe}#fb Writer:#fb0#fn{circe light} J.F. Lawton\n#fn{circe}#fb Stars:#fb0#fn{circe light} Steven Seagal, Gary Busey, Tommy Lee Jones","desc":"A former S.E.A.L., now cook, is the only person who can stop a gang of terrorists when they seize control of a U.S. Navy battleship.","itunes_link":"","netflix_link":"http://dvd.netflix.com/Movie/Under-Siege/1078313?trkid=385063","image":"http://st-im.kinopoisk.ru/im/poster/7/5/3/kinopoisk.ru-Under-Siege-753358.jpg","small_image":"http://st-im.kinopoisk.ru/im/poster/7/5/3/kinopoisk.ru-Under-Siege-753358.jpg","blocks":[{"image":"http://img.youtube.com/vi/JO1sXQ8DpYc/0.jpg","url":"http://www.youtube.com/watch?v=JO1sXQ8DpYc"},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/3/5/kinopoisk.ru-Under-Siege-2356258.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/3/5/kinopoisk.ru-Under-Siege-2356257.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/3/5/kinopoisk.ru-Under-Siege-2356256.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/3/5/kinopoisk.ru-Under-Siege-2356255.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/3/5/kinopoisk.ru-Under-Siege-2356254.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/3/5/kinopoisk.ru-Under-Siege-2356253.jpg","url":""},{"image":"http://st-im.kinopoisk.ru/im/kadr/2/3/5/kinopoisk.ru-Under-Siege-2356252.jpg","url":""}]},{"title":"On Deadly Ground On Deadly Ground","year":1994,"duration":101,"about":"#fz15#fn{circe}#fb Genre:#fb0#fn{circe light} Action-adventure film\n#fn{circe}#fb Directed by and starring:#fb0#fn{circe light} Steven Seagal\n#fn{circe}#fb Stars:#fb0#fn{circe light} Michael Caine, Joan Chen, John C. McGinley, R. Lee Ermey, Kenji Nakano, and Billy Bob Thornton in one of his early appearances\n#fn{circe}#fb Budget:#fb0#fn{circe light} $50 000 000","desc":"Aegis Oil operates Aegis 1, an oil refinery and several oil rigs in Alaska. They purchased the oil rights from the local Alaskan Natives 20 years ago, but will lose them if the refinery isn’t on-line by a certain deadline. With 13 days to go, and billions of dollars at stake, the company cuts corners and uses faulty equipment. Hugh Palmer, a rig foreman, is aware of this; as he predicts, his rig catches fire. It takes Forrest Taft (Seagal), a specialist in dealing with oil drilling-related fires, to extinguish the fire. Taft refuses to believe Hugh’s story of faulty equipment, but discovers that it’s true after accessing the company’s computer records. Michael Jennings (Michael Caine), the ruthless CEO of Aegis, believes that Hugh's carelessness is to blame and arranges for him to be ‘dealt with’ by his henchmen MacGruder (John C. McGinley) and Otto (Sven-Ole Thorsen).\n\nJennings is alerted to Taft's activities and orders that Taft be also removed. MacGruder and Otto torture and murder Palmer. Taft is set up for a trap by investigating a supposedly damaged pump station. He is badly wounded by an explosion, but survives and is rescued by Masu (Joan Chen), the daughter of Silook, the chief of her tribe.\n\nMacGruder and Otto are unable to locate Taft's body, and Jennings assumes that he is still alive. Taft is being cared for by Silook's tribe. After unsuccessfully trying to leave, using a dogsled, Silook has Taft undergo a vision quest in which he sees the truth. When made to choose between two women, Taft opts for the elderly, clothed grandmother, forgoing the erotically-charged nude Iñupiaq seductress. The grandmother warns Taft that time is running out for those who pollute the world. Taft realizes that he has no choice but to see the refinery closed. He leaves, with MacGruder and Otto hot on his trail.\n\nAt Silook's village, they demand to know where Taft is. Silook refuses to give the information and is fatally shot by MacGruder. Jennings berates MacGruder for killing Silook. They bring in a group of New Orleans-based mercenaries led by Stone (R. Lee Ermey) to finish off Taft before he can stop Aegis 1 from going on-line. They also have an FBI Anti-Terrorist Unit at the refinery.\n\nAccompanied by Masu, Taft (who is probably ex-CIA and an expert on sabotage and demolition), collects weapons and explosives and manages to enter the refinery complex. MacGruder (who was killed by Taft by throwing him in the helicopter's propeller for killing Hugh and Silook), Otto (who was killed earlier at Hugh's cabin) and Jennings’ ruthlessly efficient female assistant Liles (who crashed her truck on a gasoline tank), are powerless to stop him and are all killed in various gruesome ways.\n\nTaft and Masu confront Jennings and string him up, dropping him into the oil, effectively drowning him in his own wealth. A series of explosions destroy the rest of Aegis 1.\n\nAs an epilogue, Taft, far from being arrested for sabotage and multiple murders (self defense), is asked to deliver a speech at the Alaska State Capitol about the dangers of oil pollution, and the companies that are endangering the ecosystem. This speech is reminiscent of Charlie Chaplin's monologue at the end of The Great Dictator. During the speech they show a scene of one of the first commercial hydrogen fuel cell systems developed by Perry Energy Systems.","itunes_link":"","netflix_link":"","image":"http://ecx.images-amazon.com/images/I/81Uph0ulIlL._SL1500_.jpg","small_image":"https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcQgiehwPlkT6yclCIoqc23aAy3eSnDDFI3xJgwIyKsJ4U6c8lQx","blocks":[{"image":"http://www.film.ru/sites/default/files/movies/frames/On-Deadly-Ground-01.jpg","url":""},{"image":"http://d1jrw5jterzxwu.cloudfront.net/sites/default/files/default/files/uploads/gil-birmingham-tbt-13.jpg","url":""},{"image":"http://theactionelite.com/site/wp-content/uploads/2015/04/176737_full.jpg","url":""},{"image":"http://thedrunkenodyssey.files.wordpress.com/2013/08/on-deadly-ground-1993-1.jpg","url":"https://youtu.be/kyD_6_jFB8A"},{"image":"https://pp.vk.me/c608617/v608617643/49dc/cijgAZ5GEGo.jpg","url":""}]}],"events":[{"title":"Absolution, TODAY!!","desc":"","date":"2016-01-30T14:40","image":"http://stevenseagal.com/wp-content/uploads/2015/05/Absolution-10-300x300.png","blocks":[{"text":"Block 1","images":[]},{"text":"Block 2","images":[]}]},{"title":"Steven and George Benson","desc":"","date":"2016-02-26T18:00","image":"http://stevenseagal.com/wp-content/uploads/2014/07/Steven-Seagal-and-George-Benson-live-at-the-Cognac-Fesitival-20141-300x241.jpg","blocks":[]},{"title":"Tornado 2016","desc":"International Aikido Festival","date":"2016-03-31T11:00","image":"http://cpdev.appnow.com/service/seagal/static/test_2.jpg","blocks":[{"text":"","images":[{"image":"http://www.joblo.com/newsimages1/pod210ssmc.jpg","url":""},{"image":"http://images2.fanpop.com/image/photos/14000000/Steven-Seagal-as-Torrez-machete-14095829-1140-774.jpg","url":""}]},{"text":"","images":[{"image":"http://www.joblo.com/newsimages1/pod210ssmc.jpg","url":"https://youtu.be/7EAuLL9n42s"}]}]},{"title":"I was so desperate I did I was so desperate I did","desc":"Michael Caine: I was so desperate I did a movie with Steven Seagal In Alaska called On Deadly","date":"2010-09-11T12:00","image":"http://orig07.deviantart.net/39ce/f/2013/092/b/e/steven_seagal___muted_ryback_wallpaper_by_lionelstarkweather-d2izbke.jpg","blocks":[{"text":"When I finished my first autobiography What's It All About?, 1992 seemed like a good place to stop. I had a great film career, a worldwide best-seller, some restaurants, a beautiful house and, most importantly of all, a loving family.\n\nChristmas and New Year's Eve 1991 had been spent in Aspen, Colorado, as guests of Marvin and Barbara Davis, the Texan oil billionaires. We were surrounded by friends including Sean Connery and his wife Micheline, and Sidney and Joanna Poitier.\n\nI felt pretty happy with my lot. Everyone there had been part of my life since I first got to Hollywood – although, in fact, I'd met Sean in London in the late Fifties at what was then called a 'bottle party'. If someone was giving a party in those days and couldn't quite afford it, the invitation would be to 'bring a bottle and a bird'.\n","images":[{"image":"http://i.dailymail.co.uk/i/pix/2010/09/11/article-1311129-0B23EE7C000005DC-714_468x305.jpg","url":""}]},{"text":"Back then I was just beginning my journey from Elephant and Castle, South London, to Hollywood. I was so broke that I couldn't afford to bring a bottle, so I brought two birds. And they were both beautiful.\nI walked into this party and there was Sean, who seemed enormous com-pared with the rest of us weedy actor types, and he saw me with those two girls and I became his instant new best friend. Aspen with old friends was followed by a period back in Hollywood.\n\nI felt on top of the world. I was completely oblivious to the downturn in store for me. Looking back to this period I can see now what I couldn't see then: the storm clouds, as they say, were gathering. A movie I had made the previous year, Noises Off, had come out and gone out just as quickly.\n\nI wasn't too bothered. Everyone has a flop now and then, I thought. But it was another little sign.I took no notice. I had become part of Hollywood history. Out of the blue, Robert Mitchum, the great Fifties movie star, asked me to present his Lifetime Achievement Award at the Golden Globes.\n\nI was honoured he should ask me, but I didn't know him and had never worked with him and I was curious. 'Did you pick me because I had heavy eyelids like you?' I asked him. He said: 'Yes. They're not as heavy as mine, of course, but they're quite heavy. It's all to do with the eyelids.'","images":[{"image":"http://i.dailymail.co.uk/i/pix/2010/09/11/article-1311129-01A3BA850000044D-606_468x424.jpg","url":""}]},{"text":"","images":[{"image":"https://static-secure.guim.co.uk/sys-images/Guardian/Pix/pictures/2014/2/13/1392313040984/Terrorists--mess-with-thi-010.jpg","url":""}]}]},{"title":"666","desc":"","date":"","image":"","blocks":[]}],"news":[{"title":"Test","text":"Test\n\nGoogle: http://google.com","date":"2016-01-09T07:00","image":"http://stevenseagal.com/wp-content/uploads/2015/05/Absolution-10-300x300.png","blocks":[{"text":"Block 1","images":[]},{"text":"The Dunkerque-class battleship was a type of warship constructed for the French Navy in the 1930s.\n\nThe Dunkerques were designed to counter the German Deutschland-class pocket battleships. Their main armament was two quadruple 330 mm turrets forward, with a 225 mm (8.9 in) thick armored belt. They were smaller, with a 26,500- to 27,300-ton standard displacement and a smaller main artillery caliber, than the battleships authorized by the Washington Naval Treaty, but their speed was 7 knots higher than any of the battleships built from 1920 to 1937. When they were commissioned, only the last existing battlecruisers of the British Royal Navy and the Imperial Japanese Navy were their equals.[citation needed]\n\nGiven their characteristics, they were alternatively classified as fast battleships, small battleships,[1] battlecruisers,[2] and even as \"ships of the line\" (Fr. navires de ligne).[1]\n\nTwo ships, Dunkerque and Strasbourg, were completed. Together they formed the 1ère Division de Ligne (\"1st Division of the Line\"), and saw service during the early years of the Second World War. While they never encountered the German pocket battleships they were designed to counter, they suffered the British attack of Mers-el-Kebir, and stayed under the Vichy authorities control until they were scuttled at Toulon in November 1942.","images":[{"image":"https://upload.wikimedia.org/wikipedia/commons/6/6d/Dunkerque-1.jpg","url":""},{"image":"https://upload.wikimedia.org/wikipedia/commons/0/04/Dunkerque-206a4020.jpg","url":""},{"image":"","url":""}]},{"text":"#fz150#algC WOW!","images":[]},{"text":"\\#sseagal","images":[]}]}],"media_sources":[{"social":"facebook","social_id":"sseagalofficial"},{"social":"twitter","social_id":"sseagalofficial"},{"social":"instagram","social_id":"seagal_official"},{"social":"instagram","social_id":"stevenseagalofficial"},{"social":"instagram","social_id":"officialseagal"}]}